tests/performance/artillery-api-ci.yml
# Lightweight API performance smoke for GitHub Actions.
#
# The full artillery-api.yml profile is intentionally much heavier and depends
# on seeded auth/data paths. Keep this CI profile focused on public boot paths so
# main/develop pushes catch startup and basic latency regressions without turning
# the fast-feedback pipeline into a long load test.
config:
  target: "http://localhost:8787"
  phases:
    - duration: 20
      arrivalRate: 3
      rampTo: 8
      name: "CI API smoke"

  http:
    timeout: 10
    pool: 10

  ensure:
    - http.response_time.p95:
        max: 2000
    - http.response_time.p99:
        max: 3000

  plugins:
    expect: {}

scenarios:
  - name: "Public API boot endpoint"
    flow:
      - get:
          url: "/info"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: "name"